In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [2]:
df = pd.read_csv('data_cleaned.csv')

In [4]:
df.head()

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Size,Founded,Type of ownership,Industry,...,Revenue,hourly,employer_provided,Min Salary,Max Salary,job_state,age,python,excel,sql
0,Data Analyst I,$41K - $55K (Glassdoor est.),Job Summary:\nIf you live in or around the San...,4.3,Firstmark Credit Union,"San Antonio, TX",201 to 500 Employees,1932,Private,Banking & Lending,...,$1 to $5 billion (USD),0,0,41.0,55.0,TX,91,0,0,0
1,Reporting Data Analyst,$64K - $92K (Glassdoor est.),"Medlogix, LLC delivers innovative medical clai...",2.6,MEDLOGIX LLC,"Lansdale, PA",Unknown,-1,Private,Insurance Carriers,...,Unknown / Non-Applicable,0,0,64.0,92.0,PA,-1,0,0,0
2,Junior Data Analyst,$45K - $69K (Glassdoor est.),Hintz and Co is a boutique full service media ...,3.8,Hintz and Co,"Los Angeles, CA",1 to 50 Employees,1979,Private,Architectural & Engineering Services,...,$5 to $25 million (USD),0,0,45.0,69.0,CA,44,0,0,0
3,Data Analyst(SQL),$64K - $106K (Glassdoor est.),Job Title: Data Analyst (SQL)\nJob Summary: We...,4.1,Leading Torch LLC,"Plano, TX",1 to 50 Employees,-1,Private,-1,...,Less than $1 million (USD),0,0,64.0,106.0,TX,-1,0,0,1
4,Data Analyst (Jr.),$80K - $100K (Employer est.),Department of Veterans Affairs experience? Do ...,4.0,Ben Allegretti Consulting BAC,"Washington, DC",Unknown,2007,NaN,National Agencies,...,Unknown / Non-Applicable,0,0,80.0,100.0,DC,16,0,0,0

In [5]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Size', 'Founded', 'Type of ownership',
       'Industry', 'Sector', 'Revenue', 'hourly', 'employer_provided',
       'Min Salary', 'Max Salary', 'job_state', 'age', 'python', 'excel',
       'sql'],
      dtype='object')

In [19]:
def seniority(title):
    if 'sr' in title.lower() or 'senior' in title.lower() or 'sr' in title.lower() or 'lead' in title.lower() or 'principal' in title.lower() or 'head' in title.lower():
            return 'senior'
    elif 'jr' in title.lower() or 'jr.' in title.lower() or 'junior' in title.lower():
        return 'jr'
    else:
        return 'na'
    
def title_simplifier(title):
    if 'data scientist' in title.lower():
        return 'data scientist'
    elif 'data engineer' in title.lower():
        return 'data engineer'
    elif 'analyst' in title.lower():
        return 'analyst'
    elif 'machine learning' in title.lower():
        return 'mle'
    elif 'manager' in title.lower():
        return 'manager'
    elif 'director' in title.lower():
        return 'director'
    else:
        return 'na'

In [11]:
df['job_simp'] = df['Job Title'].apply(title_simplifier)

In [12]:
df.job_simp.value_counts()

analyst    192
Name: job_simp, dtype: int64

In [20]:
df['seniority'] = df['Job Title'].apply(seniority)
df.seniority.value_counts()

na        175
jr         15
senior      2
Name: seniority, dtype: int64

In [21]:
#  Job description length 
df['desc_len'] = df['Job Description'].apply(lambda x: len(x))
df['desc_len']

0       870
1      1004
2       875
3       749
4      1240
       ...
187     956
188     775
189    1061
190     870
191    1248
Name: desc_len, Length: 192, dtype: int64

In [25]:
df[df['hourly']==1][['hourly','Min Salary','Max Salary']]

     hourly  Min Salary  Max Salary
5         1         NaN         NaN
9         1       58.00         NaN
13        1       50.00         NaN
17        1       38.00         NaN
24        1       55.00         NaN
27        1       50.00         NaN
35        1       37.50         NaN
110       1       28.79         NaN
124       1       24.75         NaN
130       1       28.79         NaN
145       1       30.00         NaN
164       1       39.88         NaN